// ===================================================
// ||     자동완성으로 사용할 대구시 oo구 oo동 리스트
// ===================================================

export const LOCATION_LIST = [
  // --- 중구 -----
  "중구 동인동",
  "중구 동인동1가",
  "중구 동인동2가",
  "중구 동인동3가",
  "중구 동인동4가",

  "중구 삼덕동",
  "중구 삼덕동1가",
  "중구 삼덕동2가",
  "중구 삼덕동3가",
  
  "중구 성내동",
  "중구 성내1동",
  "중구 봉산동",
  "중구 동문동",
  "중구 문화동",
  "중구 공평동",
  "중구 동성로1가",
  "중구 동성로2가",
  "중구 동성로3가",
  "중구 교동",
  "중구 용덕동",
  "중구 상덕동",
  "중구 완전동",
  "중구 덕산동",
  "중구 사일동",
  "중구 남일동",
  "중구 포정동",
  "중구 태평로1가",
  "중구 화전동",
  "중구 북성로1가",
  
  "중구 성내2동",
  "중구 장관동",
  "중구 상서동",
  "중구 수동",
  "중구 종로1가",
  "중구 종로2가",
  "중구 동일동",
  "중구 전동",
  "중구 수창동",
  "중구 태평로3가",
  "중구 서성로1가",
  "중구 하서동",
  "중구 남성로",
  "중구 계산동1가",
  "중구 계산동2가",
  "중구 동산동",
  "중구 서성로2가",
  "중구 서문로1가",
  "중구 서내동",
  "중구 북성로2가",
  "중구 대안동",
  "중구 태평로2가",
  "중구 향촌동",
  "중구 북내동",
  
  "중구 성내3동",
  "중구 도원동",
  "중구 인교동",
  "중구 서야동",
  "중구 시장북로",
  "중구 서문로2가",
  "중구 달성동",

  "중구 대신동",

  "중구 남산동",
  "중구 남산1동",
  "중구 남산2동",
  "중구 남산3동",
  "중구 남산4동",
  
  "중구 대봉동",
  "중구 대봉1동",
  "중구 대봉2동",


  // --- 남구 -----
  "남구 이천동",
  "남구 봉덕동",
  "남구 봉덕1동",
  "남구 봉덕2동",
  "남구 봉덕3동",
  "남구 대명동",
  "남구 대명1동",
  "남구 대명2동",
  "남구 대명3동",
  "남구 대명4동",
  "남구 대명5동",
  "남구 대명6동",
  "남구 대명7동",
  "남구 대명8동",
  "남구 대명9동",
  "남구 대명10동",
  "남구 대명11동",

  // --- 달서구 ----
  "달서구 성당동",

  "달서구 두류동",
  "달서구 두류1동",
  "달서구 두류2동",
  "달서구 두류3동",
  "달서구 본리동",
  
  "달서구 감삼동",
  "달서구 죽전동",
  
  "달서구 장기동",
  "달서구 장동",

  "달서구 용산1동",
  "달서구 용산동",
  "달서구 용산2동",
  
  "달서구 이곡1동",
  "달서구 이곡동",
  "달서구 갈산동",

  "달서구 신당동",
  "달서구 호산동",
  "달서구 파호동",
  "달서구 호림동",

  "달서구 월성1동",
  "달서구 월성동",
  "달서구 대천동",
  "달서구 월암동",
  "달서구 월성2동",
  
  "달서구 진천동",
  "달서구 대곡동",
  "달서구 유천동",
  
  "달서구 상인동",
  "달서구 상인1동",
  "달서구 상인2동",
  "달서구 상인3동",

  "달서구 도원동",
  "달서구 송현동",
  "달서구 송현1동",
  "달서구 송현2동",
  "달서구 본동",

  //-- 동구 -----
  "동구 신암1동",
  "동구 신암2동",
  "동구 신암3동",
  "동구 신암4동",
  "동구 신암5동",

  "동구 신천1동",
  "동구 신천2동",
  "동구 신천3동",
  "동구 신천4동",

  "동구 효목1동",
  "동구 효목2동",

  "동구 도평동",
  "동구 도동",
  "동구 평광동",

  "동구 불로봉무동",
  "동구 불로동",
  "동구 봉무동",

  "동구 지저동",
  "동구 동촌동",
  "동구 입석동",
  "동구 검사동",

  "동구 방촌동",

  "동구 해안동",
  "동구 둔산동",
  "동구 부동",
  "동구 신평동",

  "동구 안심1동",
  "동구 율하동",
  "동구 신기동",

  "동구 안심2동",
  "동구 용계동",
  "동구 율암동",
  "동구 상매동",
  "동구 매여동",

  "동구 안심3동",
  "동구 괴전동",
  "동구 금강동",
  "동구 대림동",
  "동구 사복동",
  "동구 숙천동",
  "동구 동호동",
  "동구 신서동",

  "동구 안심4동",
  "동구 서호동",
  "동구 각산동",
  "동구 혁신동",
  "동구 동내동",
  "동구 내곡동",

  "동구 공산동",
  "동구 능성동",
  "동구 진인동",
  "동구 도학동",
  "동구 백안동",
  "동구 미곡동",
  "동구 용수동",
  "동구 신무동",
  "동구 미대동",
  "동구 내동",
  "동구 지묘동",
  "동구 덕곡동",
  "동구 송정동",
  "동구 신용동",
  "동구 중대동",

  // -- 북구 -----
  "북구 고성동",
  "북구 고성동1가",
  "북구 고성동2가",
  "북구 고성동3가",
  
  "북구 칠성동",
  "북구 칠성동1가",
  "북구 칠성동2가",
  
  "북구 침산동",
  "북구 침산1동",
  "북구 침산2동",
  "북구 침산3동",

  "북구 노원동",
  "북구 노원동1가",
  "북구 노원동2가",
  "북구 노원동3가",

  "북구 산격동",
  "북구 산격1동",
  "북구 산격2동",
  "북구 산격3동",
  "북구 산격4동",
  
  "북구 복현동",
  "북구 복현1동",
  "북구 복현2동",

  "북구 대현동",
  "북구 검단동",
  
  "북구 무태조야동",
  "북구 연경동",
  "북구 동변동",
  "북구 서변동",
  "북구 조야동",
  
  "북구 국우동",
  "북구 동호동",
  "북구 도남동",
  "북구 학정동",
  
  "북구 읍내동",
  "북구 관음동",
  "북구 동천동",
  "북구 구암동",
  
  "북구 태전동",
  "북구 태전1동",
  "북구 태전2동",
  
  "북구 관문동",
  "북구 사수동",
  "북구 금호동",
  "북구 매천동",
  "북구 팔달동",
  "북구 노곡동",


  // -- 서구 -----
  "서구 상중이동",
  "서구 상리동",
  "서구 중리동",
  "서구 이현동",

  "서구 내당동",
  "서구 내당1동",
  "서구 내당2동",
  "서구 내당3동",
  "서구 내당4동",

  "서구 비산동",
  "서구 비산1동",
  "서구 비산2동",
  "서구 비산3동",
  "서구 비산4동",
  "서구 비산5동",
  "서구 비산6동",
  "서구 비산7동",
  
  "서구 평리동",
  "서구 평리1동",
  "서구 평리2동",
  "서구 평리3동",
  "서구 평리4동",
  "서구 평리5동",
  "서구 평리6동",
  
  "서구 원대동",
  "서구 원대동1가",
  "서구 원대동2가",
  "서구 원대동3가",


  // -- 수성구 -----
  "수성구 범어동",
  "수성구 범어1동",
  "수성구 범어2동",
  "수성구 범어3동",
  "수성구 범어4동",
  
  "수성구 만촌동",
  "수성구 만촌1동",
  "수성구 만촌2동",
  "수성구 만촌3동",

  "수성구 수성동1가",
  "수성구 수성동2가",
  "수성구 수성동3가",
  "수성구 수성동4가",

  "수성구 황금동",
  "수성구 황금1동",
  "수성구 황금2동",

  "수성구 중동",
  "수성구 상동",
  "수성구 파동",
  "수성구 두산동",

  "수성구 지산동",
  "수성구 지산1동",
  "수성구 지산2동",

  "수성구 범물동",
  "수성구 범물1동",
  "수성구 범물2동",

  "수성구 고산1동",
  "수성구 욱수동",
  "수성구 신매동",
  
  "수성구 고산2동",
  "수성구 시지동",
  "수성구 대흥동",
  "수성구 삼덕동",
  "수성구 연호동",
  "수성구 이천동",
  "수성구 고모동",
  "수성구 가천동",
  "수성구 노변동",
  
  "수성구 고산3동",
  "수성구 매호동",
  "수성구 성동",
  "수성구 사월동",


  // -- 달성군 -----
  "달성군 화원읍",
  "달성군 논공읍",
  "달성군 다사읍",
  "달성군 유가읍",
  "달성군 옥포읍",
  "달성군 현풍읍",
  "달성군 가창면",
  "달성군 하빈면",
  "달성군 구지면",

  // -- 군위군 ---
  "군위군 군위읍",
  "군위군 소보면",
  "군위군 효령면",
  "군위군 부계면",
  "군위군 우보면",
  "군위군 의흥면",
  "군위군 산성면",
  "군위군 삼국유사면",
]